Конфигурация/Documents/ПереоценкаЗадолженностиПоДенежнымСредствам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ПереоценкаЗадолженностиПоДенежнымСредствам</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.БухгалтерскийУчет</xr:Item>
				<xr:Item>AccountingRegister.ЕдиныйБухгалтерскийУчет</xr:Item>
				<xr:Item>AccountingRegister.НалоговыйУчет</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидУчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыУчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/AccumulationRegisters/ЗадолженностиПоДенежнымСредствам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ЗадолженностиПоДенежнымСредствам</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаКупона</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеЗадолженностиПоДенежнымСредствам</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипЗадолженности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЗадолженности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЗадолженности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЗадолженности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Аванс</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/НастройкиФормированияСЧА.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>НастройкиФормированияСЧА</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПериодичностьРасчетаСЧА</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиРегламентныхДействий</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьРасчетныйКупон</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НКДВСправедливойСтоимостиЦБ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВариантРасчетаПроцентовПоСделкамРЕПО</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыРасчетаПроцентовПоСделкамРЕПО</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТочностьРасчетнойСтавкиРЕПО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КритерийСущественностиОтклоненияССТПлюс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьНастройкиУчетнойПолитикиЕПС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодичностьНачисленияРезервов</Name>
					<Comment>#538027</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ПериодичностьПереоценкиАктивов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КорзинаОФЗПК</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КорзиныОФЗПК</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/AccumulationRegisters/ОстаткиДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиДенежныхСредств</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ВидДвиженияДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДвиженийДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантДвиженияДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыОперацийПриВводеВыводеДенежныхСредств</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыЗадолженности</v8:Type>
						<v8:Type>cfg:EnumRef.ВидыПереводовДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Брокер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БрокерскиеКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МестоХранения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РасчетныйСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/УсловияСделокРЕПО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>УсловияСделокРЕПО</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Отменено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДепозитарныйСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДепозитарныеСчета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВторойЧастиРЕПО</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаИсполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОплаты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПоставки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютаОплаты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СобственныйКурсОплаты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КурсОплаты</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КурсОплаты</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиКоличество</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиЦена</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЦенаПроцент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиЦенаПроцент</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЦенаКупона</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиЦена</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаКупона</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлатежноеУсловиеСделки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтавкаРЕПО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ВидЗадолженности</Name>
					<Comment>Заполняется автоматически на основании части РЕПО</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЗадолженности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтложенноеИсполнение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РаздельноеИсполнение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СделкаРЕПО</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СделкаРЕПО</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЧастьСделкиРЕПО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Рынок</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РынкиЦенныхБумаг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЦеннаяБумага</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумаги</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/Enums/ВариантыРасчетаПроцентовПоСделкамРЕПО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВариантыРасчетаПроцентовПоСделкамРЕПО</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоСтавкеОтПервойЧастиРЕПО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоРавномерномуРаспределениюПоДням</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоРасчетнойСтавке</Name>
					<Comment>Газфонд</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Documents/ПереоценкаЗадолженностиПоДенежнымСредствам/Ext/ManagerModule.bsl
Функция РассчитатьПроцентыПоРЕПО(Организация, СчетДоверительногоУправления, Знач Дата, ЦельРасчета, СделкаРЕПО = Неопределено, Отказ = Ложь, ТочностьРасчетнойСтавкиРЕПО = 8, ВариантРасчетаПроцентовПоСделкамРЕПО = Неопределено) Экспорт
	
	Если ТипЗнч(Дата) = Тип("Граница") Тогда
		Если ТипЗнч(Дата.Значение) = Тип("МоментВремени") Тогда
			ДатаПереоценки = Дата.Значение.Дата;
		ИначеЕсли ТипЗнч(Дата.Значение) = Тип("Дата") Тогда
			ДатаПереоценки = Дата.Значение;
	    Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("При расчете процентов по РЕПО значение границы типа " + ТипЗнч(Дата.Значение) + " не обрабатывается",,,,Отказ);
			Возврат Неопределено;
		КонецЕсли;
		Если Дата.ВидГраницы = ВидГраницы.Исключая Тогда
			ВечерДатыПереоценки = ДатаПереоценки - 1;
		Иначе
			ВечерДатыПереоценки = ДатаПереоценки;
		КонецЕсли;
	ИначеЕсли ТипЗнч(Дата) = Тип("Дата") Тогда
		ДатаПереоценки = КонецДня(Дата);
		ВечерДатыПереоценки = ДатаПереоценки;
		Дата = Новый Граница(КонецДня(Дата), ВидГраницы.Включая);
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Неизвестный параметр периода для расчета процентов сделок РЕПО",,,,Отказ);
		Возврат Неопределено;
	КонецЕсли;
	
	НастройкиУчета = БухгалтерскийУчет.ОпределитьНастройкиУчета(
		ДатаПереоценки,
		Организация,
		СчетДоверительногоУправления);
		
	#Область Текст_запроса
	
	// ПРОЦЕНТЫ ПО РЕПО
	//ВНЕБИРЖА, т.е. ЧастьСделкиРЕПО = 0
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ВложенныйЗапрос.Основание КАК Основание,
		|	ВложенныйЗапрос.Валюта КАК Валюта,
		|	ВложенныйЗапрос.СуммаДолгаПоВторойЧасти КАК СуммаДолгаПоВторойЧасти,
		|	ВложенныйЗапрос.Контрагент КАК Контрагент,
		|	ВложенныйЗапрос.Брокер КАК Брокер,
		|	ВложенныйЗапрос.ОснованиеБазаРасчетаПроцентов КАК ОснованиеБазаРасчетаПроцентов,
		|	ВложенныйЗапрос.ВидСделки КАК ВидСделки,
		|	ВложенныйЗапрос.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ВЫБОР
		|		КОГДА &ВариантРасчетаПроцентовПоСделкамРЕПО <> НЕОПРЕДЕЛЕНО
		|			ТОГДА &ВариантРасчетаПроцентовПоСделкамРЕПО
		|		КОГДА &ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ПустаяСсылка)
		|			ТОГДА ЕСТЬNULL(НастройкиФормированияСЧАСрезПоследних.ВариантРасчетаПроцентовПоСделкамРЕПО, ЗНАЧЕНИЕ(Перечисление.ВариантыРасчетаПроцентовПоСделкамРЕПО.ПустаяСсылка))
		|		КОГДА ЕСТЬNULL(НастройкиПоВидуУчетаСрезПоследних.ВариантРасчетаПроцентовПоСделкамРЕПО, ЗНАЧЕНИЕ(Перечисление.ВариантыРасчетаПроцентовПоСделкамРЕПО.ПоСтавкеОтПервойЧастиРЕПО)) = ЗНАЧЕНИЕ(Перечисление.ВариантыРасчетаПроцентовПоСделкамРЕПО.ПустаяСсылка)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВариантыРасчетаПроцентовПоСделкамРЕПО.ПоСтавкеОтПервойЧастиРЕПО)
		|		ИНАЧЕ ЕСТЬNULL(НастройкиПоВидуУчетаСрезПоследних.ВариантРасчетаПроцентовПоСделкамРЕПО, ЗНАЧЕНИЕ(Перечисление.ВариантыРасчетаПроцентовПоСделкамРЕПО.ПоСтавкеОтПервойЧастиРЕПО))
		|	КОНЕЦ КАК ВариантРасчетаПроцентовПоСделкамРЕПО
		|ПОМЕСТИТЬ _ОткрытыеСделкиРЕПОБезНастроек
		|ИЗ
		|	(ВЫБРАТЬ
		|		ЗадолженностиПоДенежнымСредствамОстатки.Основание КАК Основание,
		|		ЗадолженностиПоДенежнымСредствамОстатки.Валюта КАК Валюта,
		|		ЗадолженностиПоДенежнымСредствамОстатки.СуммаОстаток + ЗадолженностиПоДенежнымСредствамОстатки.СуммаКупонаОстаток КАК СуммаДолгаПоВторойЧасти,
		|		ЗадолженностиПоДенежнымСредствамОстатки.Основание.Контрагент КАК Контрагент,
		|		ЗадолженностиПоДенежнымСредствамОстатки.Основание.Брокер КАК Брокер,
		|		ЗадолженностиПоДенежнымСредствамОстатки.Основание.БазаРасчетаПроцентов КАК ОснованиеБазаРасчетаПроцентов,
		|		ЗадолженностиПоДенежнымСредствамОстатки.Основание.ВидСделки КАК ВидСделки,
		|		ЗадолженностиПоДенежнымСредствамОстатки.СчетДоверительногоУправления КАК СчетДоверительногоУправления
		|	ИЗ
		|		РегистрНакопления.ЗадолженностиПоДенежнымСредствам.Остатки(
		|				&ДатаПереоценки,
		|				Организация = &Организация
		|					И (СчетДоверительногоУправления В (&СписокСтратегий)
		|						ИЛИ &ПоВсемСчетамДУ)
		|					И ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВторойЧастиРЕПО)
		|					И (&СделкаРЕПО = НЕОПРЕДЕЛЕНО
		|						ИЛИ Основание = &СделкаРЕПО)) КАК ЗадолженностиПоДенежнымСредствамОстатки
		|	ГДЕ
		|		ВЫРАЗИТЬ(ЗадолженностиПоДенежнымСредствамОстатки.Основание КАК Документ.СделкаРЕПО).ЧастьСделкиРЕПО = 0
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ЗадолженностиПоВторойЧастиРЕПООстатки.СделкаРЕПО,
		|		ЗадолженностиПоВторойЧастиРЕПООстатки.Валюта,
		|		ЗадолженностиПоВторойЧастиРЕПООстатки.СуммаОстаток + ЗадолженностиПоВторойЧастиРЕПООстатки.СуммаКупонаОстаток,
		|		ЗадолженностиПоВторойЧастиРЕПООстатки.СделкаРЕПО.Контрагент,
		|		ЗадолженностиПоВторойЧастиРЕПООстатки.СделкаРЕПО.Брокер,
		|		ЗадолженностиПоВторойЧастиРЕПООстатки.СделкаРЕПО.БазаРасчетаПроцентов,
		|		ЗадолженностиПоВторойЧастиРЕПООстатки.СделкаРЕПО.ВидСделки,
		|		ЗадолженностиПоВторойЧастиРЕПООстатки.СчетДоверительногоУправления
		|	ИЗ
		|		РегистрНакопления.ЗадолженностиПоВторойЧастиРЕПО.Остатки(
		|				&ДатаПереоценки,
		|				Организация = &Организация
		|					И (СчетДоверительногоУправления В (&СписокСтратегий)
		|						ИЛИ &ПоВсемСчетамДУ)
		|					И (&СделкаРЕПО = НЕОПРЕДЕЛЕНО
		|						ИЛИ СделкаРЕПО = &СделкаРЕПО)) КАК ЗадолженностиПоВторойЧастиРЕПООстатки) КАК ВложенныйЗапрос
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиПоВидуУчета.СрезПоследних(
		|				&ДатаПереоценки,
		|				ВидУчета = &ВидУчета
		|					И Организация = &Организация
		|					И (СчетДоверительногоУправления В (&СписокСтратегий)
		|						ИЛИ &ПоВсемСчетамДУ)) КАК НастройкиПоВидуУчетаСрезПоследних
		|		ПО ВложенныйЗапрос.СчетДоверительногоУправления = НастройкиПоВидуУчетаСрезПоследних.СчетДоверительногоУправления
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиУчетаОбщие.СрезПоследних(
		|				&ДатаПереоценки,
		|				Организация = &Организация
		|					И (СчетДоверительногоУправления В (&СписокСтратегий)
		|						ИЛИ &ПоВсемСчетамДУ)) КАК НастройкиУчетаОбщиеСрезПоследних
		|		ПО ВложенныйЗапрос.СчетДоверительногоУправления = НастройкиУчетаОбщиеСрезПоследних.СчетДоверительногоУправления
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиФормированияСЧА.СрезПоследних(
		|				&ДатаПереоценки,
		|				Организация = &Организация
		|					И (СчетДоверительногоУправления В (&СписокСтратегий)
		|						ИЛИ &ПоВсемСчетамДУ)) КАК НастройкиФормированияСЧАСрезПоследних
		|		ПО ВложенныйЗапрос.СчетДоверительногоУправления = НастройкиФормированияСЧАСрезПоследних.СчетДоверительногоУправления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ОткрытыеСделкиРЕПОБезНастроек.Основание КАК Основание,
		|	_ОткрытыеСделкиРЕПОБезНастроек.Валюта КАК Валюта,
		|	_ОткрытыеСделкиРЕПОБезНастроек.СуммаДолгаПоВторойЧасти КАК СуммаДолгаПоВторойЧасти,
		|	_ОткрытыеСделкиРЕПОБезНастроек.Контрагент КАК Контрагент,
		|	_ОткрытыеСделкиРЕПОБезНастроек.Брокер КАК Брокер,
		|	_ОткрытыеСделкиРЕПОБезНастроек.ОснованиеБазаРасчетаПроцентов КАК ОснованиеБазаРасчетаПроцентов,
		|	_ОткрытыеСделкиРЕПОБезНастроек.ВидСделки КАК ВидСделки,
		|	_ОткрытыеСделкиРЕПОБезНастроек.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_ОткрытыеСделкиРЕПОБезНастроек.ВариантРасчетаПроцентовПоСделкамРЕПО КАК ВариантРасчетаПроцентовПоСделкамРЕПО
		|ПОМЕСТИТЬ _ОткрытыеСделкиРЕПО
		|ИЗ
		|	_ОткрытыеСделкиРЕПОБезНастроек КАК _ОткрытыеСделкиРЕПОБезНастроек
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиУчетаОбщие.СрезПоследних КАК НастройкиУчетаОбщиеСрезПоследних
		|		ПО _ОткрытыеСделкиРЕПОБезНастроек.СчетДоверительногоУправления = НастройкиУчетаОбщиеСрезПоследних.СчетДоверительногоУправления
		|ГДЕ
		|	(ЕСТЬNULL(НастройкиУчетаОбщиеСрезПоследних.ВестиНалоговыйУчет, ИСТИНА)
		|			ИЛИ &ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ПустаяСсылка))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗадолженностиПоДенежнымСредствамОбороты.Основание КАК Основание,
		|	ЗадолженностиПоДенежнымСредствамОбороты.Валюта КАК ВалютаСделки,
		|	ЗадолженностиПоДенежнымСредствамОбороты.Период КАК Период,
		|	ВЫБОР
		|		КОГДА ЗадолженностиПоДенежнымСредствамОбороты.Период <= &ВечерВчерашнегоДня
		|			ТОГДА ЗадолженностиПоДенежнымСредствамОбороты.СуммаРасход + ЗадолженностиПоДенежнымСредствамОбороты.СуммаКупонаРасход
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Сумма,
		|	ЗадолженностиПоДенежнымСредствамОбороты.СуммаРасход + ЗадолженностиПоДенежнымСредствамОбороты.СуммаКупонаРасход КАК СуммаЗайма
		|ПОМЕСТИТЬ _ДенежныйПоток
		|ИЗ
		|	РегистрНакопления.ЗадолженностиПоДенежнымСредствам.Обороты(
		|			,
		|			&ВечерДатыПереоценки,
		|			День,
		|			Организация = &Организация
		|				И (СчетДоверительногоУправления В (&СписокСтратегий)
		|					ИЛИ &ПоВсемСчетамДУ)
		|				И Основание В
		|					(ВЫБРАТЬ
		|						_ОткрытыеСделкиРЕПО.Основание КАК Основание
		|					ИЗ
		|						_ОткрытыеСделкиРЕПО КАК _ОткрытыеСделкиРЕПО)
		|				И ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПервойЧастиРЕПО)) КАК ЗадолженностиПоДенежнымСредствамОбороты
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗадолженностиПоДенежнымСредствамОбороты.Основание,
		|	ЗадолженностиПоДенежнымСредствамОбороты.Валюта,
		|	ЗадолженностиПоДенежнымСредствамОбороты.Период,
		|	ВЫБОР
		|		КОГДА ЗадолженностиПоДенежнымСредствамОбороты.Период <= &ВечерВчерашнегоДня
		|			ТОГДА -ЗадолженностиПоДенежнымСредствамОбороты.СуммаРасход - ЗадолженностиПоДенежнымСредствамОбороты.СуммаКупонаРасход
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	-ЗадолженностиПоДенежнымСредствамОбороты.СуммаРасход - ЗадолженностиПоДенежнымСредствамОбороты.СуммаКупонаРасход
		|ИЗ
		|	РегистрНакопления.ЗадолженностиПоДенежнымСредствам.Обороты(
		|			,
		|			&ВечерДатыПереоценки,
		|			День,
		|			Организация = &Организация
		|				И (СчетДоверительногоУправления В (&СписокСтратегий)
		|					ИЛИ &ПоВсемСчетамДУ)
		|				И Основание В
		|					(ВЫБРАТЬ
		|						_ОткрытыеСделкиРЕПО.Основание КАК Основание
		|					ИЗ
		|						_ОткрытыеСделкиРЕПО КАК _ОткрытыеСделкиРЕПО)
		|				И ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВторойЧастиРЕПО)) КАК ЗадолженностиПоДенежнымСредствамОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ОткрытыеСделкиРЕПО КАК _ОткрытыеСделкиРЕПО
		|		ПО ЗадолженностиПоДенежнымСредствамОбороты.Основание = _ОткрытыеСделкиРЕПО.Основание
		|ГДЕ
		|	_ОткрытыеСделкиРЕПО.ВариантРасчетаПроцентовПоСделкамРЕПО <> &ПоРавномерномуРаспределениюПоДням
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗадолженностиПоДенежнымСредствамОбороты.Основание,
		|	ЗадолженностиПоДенежнымСредствамОбороты.Валюта,
		|	ЗадолженностиПоДенежнымСредствамОбороты.Период,
		|	ВЫБОР
		|		КОГДА ЗадолженностиПоДенежнымСредствамОбороты.Период <= &ВечерВчерашнегоДня
		|			ТОГДА ЗадолженностиПоДенежнымСредствамОбороты.СуммаКупонаПриход
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	ЗадолженностиПоДенежнымСредствамОбороты.СуммаКупонаПриход
		|ИЗ
		|	РегистрНакопления.ЗадолженностиПоДенежнымСредствам.Обороты(
		|			,
		|			&ВечерДатыПереоценки,
		|			Регистратор,
		|			Организация = &Организация
		|				И (СчетДоверительногоУправления В (&СписокСтратегий)
		|					ИЛИ &ПоВсемСчетамДУ)
		|				И ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВозвратуКупонногоДохода)
		|				И Основание В
		|					(ВЫБРАТЬ
		|						_ОткрытыеСделкиРЕПО.Основание КАК Основание
		|					ИЗ
		|						_ОткрытыеСделкиРЕПО КАК _ОткрытыеСделкиРЕПО)) КАК ЗадолженностиПоДенежнымСредствамОбороты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ОткрытыеСделкиРЕПО КАК _ОткрытыеСделкиРЕПО
		|		ПО ЗадолженностиПоДенежнымСредствамОбороты.Основание = _ОткрытыеСделкиРЕПО.Основание
		|ГДЕ
		|	_ОткрытыеСделкиРЕПО.ВариантРасчетаПроцентовПоСделкамРЕПО <> &ПоРавномерномуРаспределениюПоДням
		|	И ЗадолженностиПоДенежнымСредствамОбороты.СуммаКупонаПриход < 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ОстаткиДенежныхСредств.Регистратор,
		|	ОстаткиДенежныхСредств.Валюта,
		|	ОстаткиДенежныхСредств.Период,
		|	ВЫБОР
		|		КОГДА ОстаткиДенежныхСредств.Период <= &ВечерВчерашнегоДня
		|			ТОГДА ОстаткиДенежныхСредств.Сумма
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	ОстаткиДенежныхСредств.Сумма
		|ИЗ
		|	РегистрНакопления.ОстаткиДенежныхСредств КАК ОстаткиДенежныхСредств
		|ГДЕ
		|	(ВЫРАЗИТЬ(ОстаткиДенежныхСредств.ВариантДвиженияДенежныхСредств КАК Справочник.ВидыЗадолженности)) = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПервойЧастиРЕПО)
		|	И ОстаткиДенежныхСредств.Организация = &Организация
		|	И (ОстаткиДенежныхСредств.СчетДоверительногоУправления В (&СписокСтратегий)
		|			ИЛИ &ПоВсемСчетамДУ)
		|	И ОстаткиДенежныхСредств.Регистратор В
		|			(ВЫБРАТЬ
		|				_ОткрытыеСделкиРЕПО.Основание КАК Основание
		|			ИЗ
		|				_ОткрытыеСделкиРЕПО КАК _ОткрытыеСделкиРЕПО)
		|	И ОстаткиДенежныхСредств.Период <= &ВечерДатыПереоценки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДенежныйПоток.Основание КАК Основание,
		|	НАЧАЛОПЕРИОДА(ДенежныйПоток.Период, ДЕНЬ) КАК Период,
		|	СУММА(ДенежныйПоток.Сумма) КАК Сумма,
		|	СУММА(ДенежныйПоток.СуммаЗайма) КАК СуммаЗайма
		|ПОМЕСТИТЬ _ДенежныйПотокСводный
		|ИЗ
		|	_ДенежныйПоток КАК ДенежныйПоток
		|
		|СГРУППИРОВАТЬ ПО
		|	ДенежныйПоток.Основание,
		|	ДенежныйПоток.ВалютаСделки,
		|	НАЧАЛОПЕРИОДА(ДенежныйПоток.Период, ДЕНЬ)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДенежныйПотокСводный.Основание КАК Основание,
		|	ДенежныйПотокСводный.Период КАК Период,
		|	СУММА(ЕСТЬNULL(ДенежныйПоток1.Сумма, 0)) КАК СумманаНачало,
		|	ДенежныйПотокСводный.Сумма КАК Дельта,
		|	ДенежныйПотокСводный.Сумма + СУММА(ЕСТЬNULL(ДенежныйПоток1.Сумма, 0)) КАК НаКонецДня,
		|	ДенежныйПотокСводный.СуммаЗайма + СУММА(ЕСТЬNULL(ДенежныйПоток1.СуммаЗайма, 0)) КАК НаКонецДняСуммаЗайма,
		|	МАКСИМУМ(ДенежныйПоток1.Период) КАК Период0
		|ПОМЕСТИТЬ _ОстаткиПоДатам
		|ИЗ
		|	_ДенежныйПотокСводный КАК ДенежныйПотокСводный
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ДенежныйПотокСводный КАК ДенежныйПоток1
		|		ПО ДенежныйПотокСводный.Основание = ДенежныйПоток1.Основание
		|			И ДенежныйПотокСводный.Период > ДенежныйПоток1.Период
		|
		|СГРУППИРОВАТЬ ПО
		|	ДенежныйПотокСводный.Основание,
		|	ДенежныйПотокСводный.Период,
		|	ДенежныйПотокСводный.Сумма,
		|	ДенежныйПотокСводный.СуммаЗайма
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ОткрытыеСделкиРЕПО.Основание КАК Основание,
		|	УсловияСделокРЕПО.СтавкаРЕПО КАК СтавкаРЕПО,
		|	УсловияСделокРЕПО.Период КАК Период,
		|	УсловияСделокРЕПО.Сумма КАК Сумма,
		|	УсловияСделокРЕПО.СуммаКупона КАК СуммаКупона,
		|	УсловияСделокРЕПО.ДатаВторойЧастиРЕПО КАК ДатаВторойЧастиРЕПО,
		|	УсловияСделокРЕПО.ДатаОплаты КАК ДатаОплаты
		|ПОМЕСТИТЬ _УсловияСделок
		|ИЗ
		|	_ОткрытыеСделкиРЕПО КАК _ОткрытыеСделкиРЕПО
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияСделокРЕПО КАК УсловияСделокРЕПО
		|		ПО _ОткрытыеСделкиРЕПО.Основание = УсловияСделокРЕПО.СделкаРЕПО
		|			И (УсловияСделокРЕПО.ЧастьСделкиРЕПО = 2)
		|ГДЕ
		|	УсловияСделокРЕПО.Период <= &ВечерДатыПереоценки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	МИНИМУМ(_УсловияСделок.Период) КАК Период,
		|	_УсловияСделок.Основание КАК Основание
		|ПОМЕСТИТЬ _ДатыИзмененияСтавокНачало
		|ИЗ
		|	_УсловияСделок КАК _УсловияСделок
		|
		|СГРУППИРОВАТЬ ПО
		|	_УсловияСделок.Основание
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_УсловияСделок.Период,
		|	_УсловияСделок.Основание
		|ИЗ
		|	_УсловияСделок КАК _УсловияСделок
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			_УсловияСделок.Период КАК Период,
		|			_УсловияСделок.Основание КАК Основание,
		|			_УсловияСделок.СтавкаРЕПО КАК СтавкаРЕПО,
		|			МИНИМУМ(_УсловияСделок1.Период) КАК ДатаПредыдущегоУсловия
		|		ИЗ
		|			_УсловияСделок КАК _УсловияСделок
		|				ЛЕВОЕ СОЕДИНЕНИЕ _УсловияСделок КАК _УсловияСделок1
		|				ПО _УсловияСделок.Основание = _УсловияСделок1.Основание
		|					И _УсловияСделок.Период < _УсловияСделок1.Период
		|		
		|		СГРУППИРОВАТЬ ПО
		|			_УсловияСделок.Период,
		|			_УсловияСделок.Основание,
		|			_УсловияСделок.СтавкаРЕПО) КАК _УсловияСделокСледующие
		|		ПО _УсловияСделок.Основание = _УсловияСделокСледующие.Основание
		|			И _УсловияСделок.Период = _УсловияСделокСледующие.ДатаПредыдущегоУсловия
		|			И _УсловияСделок.СтавкаРЕПО <> _УсловияСделокСледующие.СтавкаРЕПО
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТекущийПериод.Основание КАК Основание,
		|	ТекущийПериод.Период КАК Период,
		|	ТекущийПериод.СтавкаРЕПО КАК Ставка
		|ПОМЕСТИТЬ _ДатыАктуальныхСтавок
		|ИЗ
		|	(ВЫБРАТЬ
		|		_УсловияСделок.Основание КАК Основание,
		|		_УсловияСделок.Период КАК Период,
		|		МИНИМУМ(_УсловияСделок1.Период) КАК КонецПериода
		|	ИЗ
		|		_УсловияСделок КАК _УсловияСделок
		|			ЛЕВОЕ СОЕДИНЕНИЕ _УсловияСделок КАК _УсловияСделок1
		|			ПО _УсловияСделок.Основание = _УсловияСделок1.Основание
		|				И _УсловияСделок.Период < _УсловияСделок1.Период
		|	
		|	СГРУППИРОВАТЬ ПО
		|		_УсловияСделок.Основание,
		|		_УсловияСделок.Период) КАК _ПериодыУсловий
		|		ЛЕВОЕ СОЕДИНЕНИЕ _УсловияСделок КАК ТекущийПериод
		|		ПО _ПериодыУсловий.Период = ТекущийПериод.Период
		|			И _ПериодыУсловий.Основание = ТекущийПериод.Основание
		|		ЛЕВОЕ СОЕДИНЕНИЕ _УсловияСделок КАК СледующийПериод
		|		ПО _ПериодыУсловий.КонецПериода = СледующийПериод.Период
		|			И _ПериодыУсловий.Основание = СледующийПериод.Основание
		|			И (ТекущийПериод.СтавкаРЕПО = СледующийПериод.СтавкаРЕПО)
		|ГДЕ
		|	СледующийПериод.Период ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ТаблицаДат.Основание КАК Основание,
		|	ТаблицаДат.Период КАК Период
		|ПОМЕСТИТЬ _СписокПериодов
		|ИЗ
		|	(ВЫБРАТЬ
		|		ОстаткиПоДатам.Основание КАК Основание,
		|		ОстаткиПоДатам.Период КАК Период
		|	ИЗ
		|		_ОстаткиПоДатам КАК ОстаткиПоДатам
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		_ДатыИзмененияСтавокНачало.Основание,
		|		НАЧАЛОПЕРИОДА(_ДатыИзмененияСтавокНачало.Период, ДЕНЬ)
		|	ИЗ
		|		_ДатыИзмененияСтавокНачало КАК _ДатыИзмененияСтавокНачало) КАК ТаблицаДат
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_СписокПериодов.Основание КАК Основание,
		|	_СписокПериодов.Период КАК Период,
		|	МАКСИМУМ(ОстаткиПоДатам.Период) КАК ПериодОстатков
		|ПОМЕСТИТЬ _ДатыОстатковДляПериодов
		|ИЗ
		|	_СписокПериодов КАК _СписокПериодов
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ОстаткиПоДатам КАК ОстаткиПоДатам
		|		ПО (ОстаткиПоДатам.Период <= _СписокПериодов.Период)
		|			И _СписокПериодов.Основание = ОстаткиПоДатам.Основание
		|
		|СГРУППИРОВАТЬ ПО
		|	_СписокПериодов.Основание,
		|	_СписокПериодов.Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_СписокПериодов.Основание КАК Основание,
		|	_СписокПериодов.Период КАК Период,
		|	МИНИМУМ(_ДатыАктуальныхСтавок.Период) КАК ПериодУсловий
		|ПОМЕСТИТЬ _ДатыУсловийДляПериодов
		|ИЗ
		|	_СписокПериодов КАК _СписокПериодов
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ДатыАктуальныхСтавок КАК _ДатыАктуальныхСтавок
		|		ПО _СписокПериодов.Период <= _ДатыАктуальныхСтавок.Период
		|			И _СписокПериодов.Основание = _ДатыАктуальныхСтавок.Основание
		|
		|СГРУППИРОВАТЬ ПО
		|	_СписокПериодов.Основание,
		|	_СписокПериодов.Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_СписокПериодов.Основание КАК Основание,
		|	_СписокПериодов.Период КАК Период,
		|	МИНИМУМ(_СписокПериодов1.Период) КАК СледующийПериод
		|ПОМЕСТИТЬ _ДатыСледующихПериодов
		|ИЗ
		|	_СписокПериодов КАК _СписокПериодов
		|		ЛЕВОЕ СОЕДИНЕНИЕ _СписокПериодов КАК _СписокПериодов1
		|		ПО _СписокПериодов.Основание = _СписокПериодов1.Основание
		|			И _СписокПериодов.Период < _СписокПериодов1.Период
		|
		|СГРУППИРОВАТЬ ПО
		|	_СписокПериодов.Основание,
		|	_СписокПериодов.Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_СписокПериодов.Основание КАК Основание,
		|	_СписокПериодов.Основание.ВидСделки КАК ВидСделки,
		|	НАЧАЛОПЕРИОДА(_СписокПериодов.Период, ДЕНЬ) КАК ПериодС,
		|	НАЧАЛОПЕРИОДА(ЕСТЬNULL(_ДатыСледующихПериодов.СледующийПериод, ДОБАВИТЬКДАТЕ(&ВечерВчерашнегоДня, ДЕНЬ, 1)), ДЕНЬ) КАК ПериодПо,
		|	ОстаткиПоДатам.НаКонецДня * ВЫБОР
		|		КОГДА _ОткрытыеСделкиРЕПО.ВидСделки = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Покупка)
		|			ТОГДА 1
		|		ИНАЧЕ -1
		|	КОНЕЦ КАК СуммаПериода,
		|	ОстаткиПоДатам.НаКонецДняСуммаЗайма * ВЫБОР
		|		КОГДА _ОткрытыеСделкиРЕПО.ВидСделки = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Покупка)
		|			ТОГДА 1
		|		ИНАЧЕ -1
		|	КОНЕЦ КАК СуммаВЗалоге,
		|	_УсловияСделок.СтавкаРЕПО КАК СтавкаРЕПО,
		|	_ОткрытыеСделкиРЕПО.ОснованиеБазаРасчетаПроцентов КАК БазаРасчетаПроцентов,
		|	_ОткрытыеСделкиРЕПО.Валюта КАК ВалютаСделки,
		|	_ОткрытыеСделкиРЕПО.Контрагент КАК Контрагент,
		|	_ОткрытыеСделкиРЕПО.Брокер КАК Брокер,
		|	НАЧАЛОПЕРИОДА(_СписокПериодов.Основание.Дата, ДЕНЬ) КАК ДатаРЕПО,
		|	(_УсловияСделок.Сумма + _УсловияСделок.СуммаКупона) * ВЫБОР
		|		КОГДА _ОткрытыеСделкиРЕПО.ВидСделки = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Покупка)
		|			ТОГДА 1
		|		ИНАЧЕ -1
		|	КОНЕЦ КАК СуммаЗакрытияРЕПО,
		|	ВЫБОР
		|		КОГДА НАЧАЛОПЕРИОДА(_УсловияСделок.ДатаВторойЧастиРЕПО, ДЕНЬ) > ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА НАЧАЛОПЕРИОДА(_УсловияСделок.ДатаВторойЧастиРЕПО, ДЕНЬ)
		|		ИНАЧЕ _УсловияСделок.ДатаОплаты
		|	КОНЕЦ КАК ДатаЗакрытияРЕПО,
		|	(УсловияСделокРЕПОСрезПоследних.Сумма + УсловияСделокРЕПОСрезПоследних.СуммаКупона) * ВЫБОР
		|		КОГДА _ОткрытыеСделкиРЕПО.ВидСделки = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Покупка)
		|			ТОГДА 1
		|		ИНАЧЕ -1
		|	КОНЕЦ КАК СуммаРЕПО,
		|	ВЫРАЗИТЬ(ОстаткиПоДатам.Основание КАК Документ.СделкаРЕПО).МестоХранения КАК МестоХранения,
		|	_ОткрытыеСделкиРЕПО.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_ОткрытыеСделкиРЕПО.ВариантРасчетаПроцентовПоСделкамРЕПО КАК ВариантРасчетаПроцентовПоСделкамРЕПО
		|ИЗ
		|	_СписокПериодов КАК _СписокПериодов
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ДатыОстатковДляПериодов КАК _ДатыОстатковДляПериодов
		|		ПО _СписокПериодов.Основание = _ДатыОстатковДляПериодов.Основание
		|			И _СписокПериодов.Период = _ДатыОстатковДляПериодов.Период
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ОстаткиПоДатам КАК ОстаткиПоДатам
		|		ПО (_ДатыОстатковДляПериодов.Основание = ОстаткиПоДатам.Основание)
		|			И (_ДатыОстатковДляПериодов.ПериодОстатков = ОстаткиПоДатам.Период)
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ОткрытыеСделкиРЕПО КАК _ОткрытыеСделкиРЕПО
		|		ПО (ОстаткиПоДатам.Основание = _ОткрытыеСделкиРЕПО.Основание)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияСделокРЕПО.СрезПоследних(
		|				&ДатаПереоценки,
		|				Организация = &Организация
		|					И (СчетДоверительногоУправления В (&СписокСтратегий)
		|						ИЛИ &ПоВсемСчетамДУ)
		|					И ЧастьСделкиРЕПО = 1) КАК УсловияСделокРЕПОСрезПоследних
		|		ПО (ОстаткиПоДатам.Основание = УсловияСделокРЕПОСрезПоследних.СделкаРЕПО)
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ДатыУсловийДляПериодов КАК _ДатыУсловийДляПериодов
		|		ПО _СписокПериодов.Основание = _ДатыУсловийДляПериодов.Основание
		|			И _СписокПериодов.Период = _ДатыУсловийДляПериодов.Период
		|		ЛЕВОЕ СОЕДИНЕНИЕ _УсловияСделок КАК _УсловияСделок
		|		ПО (_ДатыУсловийДляПериодов.Основание = _УсловияСделок.Основание)
		|			И (_ДатыУсловийДляПериодов.ПериодУсловий = _УсловияСделок.Период)
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ДатыСледующихПериодов КАК _ДатыСледующихПериодов
		|		ПО _СписокПериодов.Основание = _ДатыСледующихПериодов.Основание
		|			И _СписокПериодов.Период = _ДатыСледующихПериодов.Период
		|
		|УПОРЯДОЧИТЬ ПО
		|	Основание,
		|	ПериодС";
	
	#КонецОбласти
	
	//В запросе считаем что при равномерном распределении по дням исполнение первой части всегда идет одним днем. Ибо сам метод странный. 
	//Если возникают денежные потоки, то нужно выяснять у заказчика как такое считать.
	
	ВидУчета 		= БухгалтерскийУчетПовтИсп.ОпределитьВидУчетаПоЦелиРасчета(ЦельРасчета);
	СписокСтратегий = Справочники.СчетаДоверительногоУправления.ПолучитьМассивСчетовПоДоговоруДУ(СчетДоверительногоУправления);
	
	Запрос.УстановитьПараметр("Организация",								Организация);
	Запрос.УстановитьПараметр("ВидУчета", 									ВидУчета);
	Запрос.УстановитьПараметр("ДатаПереоценки", 							Дата);
	Запрос.УстановитьПараметр("ВечерДатыПереоценки", 						ВечерДатыПереоценки);
	Запрос.УстановитьПараметр("ВечерВчерашнегоДня", 						НачалоДня(ДатаПереоценки)-1);//Проценты начисляются со дня след. за днем исполнения первой части	
	Запрос.УстановитьПараметр("СписокСтратегий", 							СписокСтратегий);
	Запрос.УстановитьПараметр("ПоВсемСчетамДУ", 							СписокСтратегий.Количество() = 0);
	Запрос.УстановитьПараметр("ПоРавномерномуРаспределениюПоДням", 			Перечисления.ВариантыРасчетаПроцентовПоСделкамРЕПО.ПоРавномерномуРаспределениюПоДням);
	Запрос.УстановитьПараметр("СделкаРЕПО", 								СделкаРЕПО);
	Запрос.УстановитьПараметр("ВариантРасчетаПроцентовПоСделкамРЕПО",		ВариантРасчетаПроцентовПоСделкамРЕПО);
	
	Если ЗначениеЗаполнено(ВидУчета) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "НалоговыйУчет", РаботаСМетаданнымиПовтИсп.ПолучитьИдентификаторПеречисления(ВидУчета));
	КонецЕсли;
	
	Результат = Запрос.Выполнить();
	
	СуммыЗаймовПоПериодам = Результат.Выгрузить();
	
	СуммыЗаймовПоПериодам.Колонки.Добавить("СуммаПроцентов", Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(19,4)));
	
	НакопленныеПроцентыДляРавномерногоРаспределения = Новый ТаблицаЗначений;
	НакопленныеПроцентыДляРавномерногоРаспределения.Колонки.Добавить("СделкаРЕПО");
	НакопленныеПроцентыДляРавномерногоРаспределения.Колонки.Добавить("СуммаПроцентовПрошлыхПериодов");
	
	ТекСделка = Неопределено;
	
	Для Каждого СтрокаСуммЗаймовПоПериодам ИЗ СуммыЗаймовПоПериодам Цикл
		
		Если СтрокаСуммЗаймовПоПериодам.ВариантРасчетаПроцентовПоСделкамРЕПО = Перечисления.ВариантыРасчетаПроцентовПоСделкамРЕПО.ПоСтавкеОтПервойЧастиРЕПО Тогда
		
			СтрокаСуммЗаймовПоПериодам.СуммаПроцентов = РаботаСоСделкамиРЕПО.РассчитатьСправедливуюСтоимостьЗадолженностиПоСделкеРЕПО(
				СтрокаСуммЗаймовПоПериодам.СуммаПериода,
				СтрокаСуммЗаймовПоПериодам.СтавкаРЕПО,
				СтрокаСуммЗаймовПоПериодам.ПериодС,
				СтрокаСуммЗаймовПоПериодам.ПериодПо,
				СтрокаСуммЗаймовПоПериодам.БазаРасчетаПроцентов) - СтрокаСуммЗаймовПоПериодам.СуммаПериода;
				
		ИначеЕсли СтрокаСуммЗаймовПоПериодам.ВариантРасчетаПроцентовПоСделкамРЕПО = Перечисления.ВариантыРасчетаПроцентовПоСделкамРЕПО.ПоРавномерномуРаспределениюПоДням Тогда
			
			СуммаПроцентовПрошлыхПериодов = 0;				
			СтрокаПроцентов = Неопределено;
			Если СтрокаСуммЗаймовПоПериодам.ПериодС > СтрокаСуммЗаймовПоПериодам.ДатаРЕПО Тогда
				СтрокаПроцентов = НакопленныеПроцентыДляРавномерногоРаспределения.Найти(СтрокаСуммЗаймовПоПериодам.Основание, "СделкаРЕПО");
				Если СтрокаПроцентов <> Неопределено Тогда
					СуммаПроцентовПрошлыхПериодов = СтрокаПроцентов.СуммаПроцентовПрошлыхПериодов;
				КонецЕсли;
			КонецЕсли;
			
			СтрокаСуммЗаймовПоПериодам.СуммаПроцентов = РаботаСоСделкамиРЕПО.РассчитатьЗадолженностьПоСделкеРЕПОПоРавномерномуРаспределениюПоДням(
				СтрокаСуммЗаймовПоПериодам.СуммаПериода + СуммаПроцентовПрошлыхПериодов,
				СтрокаСуммЗаймовПоПериодам.СуммаЗакрытияРЕПО,
				СтрокаСуммЗаймовПоПериодам.ПериодС,
				СтрокаСуммЗаймовПоПериодам.ДатаЗакрытияРЕПО,
				МИН(НачалоДня(ДатаПереоценки), СтрокаСуммЗаймовПоПериодам.ДатаЗакрытияРЕПО)) - (СтрокаСуммЗаймовПоПериодам.СуммаПериода + СуммаПроцентовПрошлыхПериодов);
				
			//накапливаем проценты
			Если НачалоДня(ДатаПереоценки) > СтрокаСуммЗаймовПоПериодам.ДатаЗакрытияРЕПО Тогда
				
				Если СтрокаПроцентов = Неопределено Тогда
					СтрокаПроцентов = НакопленныеПроцентыДляРавномерногоРаспределения.Добавить();
					СтрокаПроцентов.СделкаРЕПО = СтрокаСуммЗаймовПоПериодам.Основание;
					СтрокаПроцентов.СуммаПроцентовПрошлыхПериодов = СтрокаСуммЗаймовПоПериодам.СуммаПроцентов;
				Иначе
					СтрокаПроцентов.СуммаПроцентовПрошлыхПериодов = СтрокаПроцентов.СуммаПроцентовПрошлыхПериодов + СтрокаСуммЗаймовПоПериодам.СуммаПроцентов;
				КонецЕсли;
				
			КонецЕсли;
							
		ИначеЕсли СтрокаСуммЗаймовПоПериодам.ВариантРасчетаПроцентовПоСделкамРЕПО = Перечисления.ВариантыРасчетаПроцентовПоСделкамРЕПО.ПоРасчетнойСтавке Тогда
			
			Если СтрокаСуммЗаймовПоПериодам.СуммаПериода = 0 Тогда // т.е. РЕПО открылось в день переоценки и ничего начислять не надо - за 1ый день РЕПО % не начисляются
				
				СтрокаСуммЗаймовПоПериодам.СуммаПроцентов = 0;
				
				Продолжить;	// сделал так, потому, что в функция РассчитатьСтавкуРЕПО не учитывает ситуацию СтрокаСуммЗаймовПоПериодам.СуммаПериода = 0 и дохнет
			
			КонецЕсли;
						
			Если СтрокаСуммЗаймовПоПериодам.ДатаРЕПО = СтрокаСуммЗаймовПоПериодам.ПериодС Тогда
				//первый период по этой сделке
				РанееРассчитанныйПроцент = 0;
				ТекСделка = СтрокаСуммЗаймовПоПериодам.Основание; 
			КонецЕсли;
				
			РасчетнаяСтавка = РаботаСоСделкамиРЕПО.РассчитатьСтавкуРЕПО(
				СтрокаСуммЗаймовПоПериодам.СуммаПериода,
				СтрокаСуммЗаймовПоПериодам.СуммаЗакрытияРЕПО - РанееРассчитанныйПроцент,
				СтрокаСуммЗаймовПоПериодам.ПериодС,//ДатаРЕПО,
				СтрокаСуммЗаймовПоПериодам.ДатаЗакрытияРЕПО,
				ТочностьРасчетнойСтавкиРЕПО);
				
			СтрокаСуммЗаймовПоПериодам.СуммаПроцентов = РаботаСоСделкамиРЕПО.РассчитатьСправедливуюСтоимостьЗадолженностиПоСделкеРЕПО(
				СтрокаСуммЗаймовПоПериодам.СуммаПериода,
				РасчетнаяСтавка,
				СтрокаСуммЗаймовПоПериодам.ПериодС,
				СтрокаСуммЗаймовПоПериодам.ПериодПо,
				СтрокаСуммЗаймовПоПериодам.БазаРасчетаПроцентов) - СтрокаСуммЗаймовПоПериодам.СуммаПериода;
				
			Если ТекСделка = СтрокаСуммЗаймовПоПериодам.Основание Тогда
				РанееРассчитанныйПроцент = РанееРассчитанныйПроцент + СтрокаСуммЗаймовПоПериодам.СуммаПроцентов;
			Иначе
				//сортировка должна быть по полям Основание и ПериодС
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Возникла проблема с сортировкой данных расчета РЕПО, обратитесь к программистам",,,,Отказ);
				РанееРассчитанныйПроцент = 0;
				ТекСделка = Неопределено;
			КонецЕсли;
				
		Иначе	
			
			Справочники.ВариантыРасчетаОценочнойСтоимости.СообщитьОНеизвестномВариантеРасчетаПроцентовПоСделкамРЕПО(СтрокаСуммЗаймовПоПериодам.СчетДоверительногоУправления, СтрокаСуммЗаймовПоПериодам.ВариантРасчетаПроцентовПоСделкамРЕПО, Отказ);
		    Прервать;
			
		КонецЕсли;
			
	КонецЦикла;
	
	Возврат СуммыЗаймовПоПериодам;
	
КонецФункции

Функция ЕстьСделкиРЕПО(День, Организация, СчетДоверительногоУправления) Экспорт 

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	УсловияСделокРЕПО.Регистратор КАК Регистратор
		|ИЗ
		|	РегистрСведений.УсловияСделокРЕПО КАК УсловияСделокРЕПО
		|ГДЕ
		|	(УсловияСделокРЕПО.ДатаИсполнения МЕЖДУ &НачалоПериода И &ОкончаниеПериода
		|			ИЛИ УсловияСделокРЕПО.ДатаОплаты МЕЖДУ &НачалоПериода И &ОкончаниеПериода)
		|	И УсловияСделокРЕПО.Организация = &Организация
		|	И УсловияСделокРЕПО.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И УсловияСделокРЕПО.ЧастьСделкиРЕПО = 1";
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(День));
	Запрос.УстановитьПараметр("ОкончаниеПериода", КонецДня(День));
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетДоверительногоУправления);
	
	Возврат НЕ Запрос.Выполнить().Пустой();

КонецФункции

Функция НужнаПереоценкаПоАктиву(Дата, Организация, СчетДоверительногоУправления, ВидАктива, ВидУчета, ТолькоПервоначальноеПризнание = Неопределено) Экспорт
	
	НастройкиАктиваПоВидуУчета = БухгалтерскийУчет.ОпределитьНастройкиУчетаАктива(Дата, Организация, СчетДоверительногоУправления, ВидАктива, ВидУчета);
	
	ЕстьПоручениеНаПереоценку = Ложь;
	Если ВидАктива = Справочники.УчетныеАктивы.ЗадолженностьДСПоСделкамТПлюс Тогда
		ЕстьПоручениеНаПереоценку = РаботаСПереоценкой.ОпределитьНаличиеПорученияНаПереоценку(Организация, СчетДоверительногоУправления, НачалоДня(Дата), ВидУчета, Перечисления.ВидыАктивовДляПорученийНаПереоценку.Задолженность);
	КонецЕсли;
	
	Переоценивать = Ложь;
	ТолькоПервоначальноеПризнание = Ложь;
	ПереоцениватьВДеньОперации = Ложь;
	
	Если ЗначениеЗаполнено(НастройкиАктиваПоВидуУчета.ПериодичностьПереоценки) Тогда
		Если НастройкиАктиваПоВидуУчета.ПериодичностьПереоценки <> Перечисления.ПериодичностьПереоценкиАктивов.НеПереоценивать
			ИЛИ ЕстьПоручениеНаПереоценку Тогда
			
			КалендарьДляСчетаДУ = РаботаСПереоценкой.ПолучитьКалендарьДляСчетаДУ(Организация, СчетДоверительногоУправления, Дата);
			
			ДатаДокумента = НачалоДня(Дата);
			
			ЭтоКонецМесяца					= НачалоДня(КонецМесяца(ДатаДокумента)) = ДатаДокумента;
			ЭтоПоследнийРабочийДеньМесяца	= НачалоДня(Справочники.Календари.ПолучитьБлижайшуюРабочуюДату(КалендарьДляСчетаДУ, НачалоДня(КонецМесяца(ДатаДокумента)))) = ДатаДокумента;
			ЭтоРабочийДень					= Справочники.Календари.ПолучитьБлижайшуюРабочуюДату(Справочники.Календари.Общероссийский, ДатаДокумента) = ДатаДокумента;
			
			ПереоцениватьВДеньОперации = НастройкиАктиваПоВидуУчета.ПереоцениватьВДеньОперации; 

			Если НастройкиАктиваПоВидуУчета.ПериодичностьПереоценки = Перечисления.ПериодичностьПереоценкиАктивов.Ежедневно Тогда
				Если ЭтоРабочийДень ИЛИ ЭтоПоследнийРабочийДеньМесяца ИЛИ ЕстьПоручениеНаПереоценку ИЛИ ДатаДокумента < '20240601' Тогда // до 1.6.14 не учитывали настройку ПереоцениватьВНерабочиеДни
					Возврат Истина;
				Иначе
					Возврат НастройкиАктиваПоВидуУчета.ПереоцениватьВНерабочиеДни ИЛИ ЭтоКонецМесяца;
				КонецЕсли;
			ИначеЕсли БухгалтерскийУчетЕПС.ПроверкаНеобходимостиПереоценки(НастройкиАктиваПоВидуУчета.ПериодичностьПереоценки, ДатаДокумента, КалендарьДляСчетаДУ)
				ИЛИ ЕстьПоручениеНаПереоценку Тогда
			
				Переоценивать =  Истина;
			КонецЕсли;
			
		КонецЕсли;
			
		Если НЕ Переоценивать И ПереоцениватьВДеньОперации 
			И (ВидАктива = Справочники.УчетныеАктивы.РасчетыПоОбратномуРЕПО ИЛИ ВидАктива = Справочники.УчетныеАктивы.РасчетыПоПрямомуРЕПО) Тогда
			Переоценивать = ЕстьСделкиРЕПО(Дата, Организация, СчетДоверительногоУправления);
			ТолькоПервоначальноеПризнание = Переоценивать;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Переоценивать;
	
КонецФункции

Функция НужнаПереоценкаЗадолженностей(Дата, Организация, СчетДоверительногоУправления, ВидУчета) Экспорт
	
	ПериодичностьПереоценкиЗадолженностей = БухгалтерскийУчет.ОпределитьНастройкуДляВидаУчета(Дата, Организация, СчетДоверительногоУправления, ВидУчета, "ПериодичностьПереоценкиЗадолженностей");
	
	Переоценивать = Ложь;
	
	Если ЗначениеЗаполнено(ПериодичностьПереоценкиЗадолженностей) Тогда
		Если ПериодичностьПереоценкиЗадолженностей <> Перечисления.ПериодичностьПереоценкиАктивов.НеПереоценивать Тогда
			
			КалендарьДляСчетаДУ = РаботаСПереоценкой.ПолучитьКалендарьДляСчетаДУ(Организация, СчетДоверительногоУправления, Дата);
			
			ДатаДокумента = НачалоДня(Дата);
			
			Если БухгалтерскийУчетЕПС.ПроверкаНеобходимостиПереоценки(ПериодичностьПереоценкиЗадолженностей, ДатаДокумента, КалендарьДляСчетаДУ)
				Тогда
				Переоценивать =  Истина;
			КонецЕсли;
			
		КонецЕсли;
			
	КонецЕсли;
	
	Возврат Переоценивать;
	
КонецФункции

Функция Нужно_ПризнатьРасходыПоБиржевымДепозитам(Дата, Организация, СчетДоверительногоУправления, ВидУчета) Экспорт
	
	МетодПризнанияРасходовПоБиржевымДепозитам = БухгалтерскийУчет.ОпределитьНастройкуДляВидаУчета(
		Дата,
		Организация,
		СчетДоверительногоУправления,
		ВидУчета,
		"МетодПризнанияРасходовПоБиржевымДепозитам");	
		
		Возврат МетодПризнанияРасходовПоБиржевымДепозитам = Перечисления.МетодыПризнанияРасходовПоСделкам.ВЗависимостиОтПериодичности
		ИЛИ МетодПризнанияРасходовПоБиржевымДепозитам = Перечисления.МетодыПризнанияРасходовПоСделкам.ПриНачислении
		
КонецФункции

Функция Нужно_ГлаваБ_НачислитьПроцентыПоРЕПО(Дата, Организация, СчетДоверительногоУправления) Экспорт
		
	КалендарьДляСчетаДУ = РаботаСПереоценкой.ПолучитьКалендарьДляСчетаДУ(Организация, СчетДоверительногоУправления, Дата);
		
	РабочийДень = Справочники.Календари.ЭтоРабочийДень(КалендарьДляСчетаДУ, Дата);
	
	ПериодичностиДаты = БухгалтерскийУчетЕПС.ПолучитьПериодичностиДаты(Дата);
														
	НастройкиПроцентыПоРЕПО = БухгалтерскийУчет.ОпределитьНастройкиУчетаАктива(
									Дата,
									Организация,
									СчетДоверительногоУправления,
									Справочники.УчетныеАктивыЕПС.ПроцентыПоРЕПО,
									Перечисления.ВидыУчета.ЕдиныйБухгалтерскийУчет);
	
	ПериодичностьПереоценки = НастройкиПроцентыПоРЕПО.ПериодичностьПереоценки;
	ПереоцениватьВНерабочиеДни = НастройкиПроцентыПоРЕПО.ПереоцениватьВНерабочиеДни; 
	ПереоцениватьВДеньОперации = НастройкиПроцентыПоРЕПО.ПереоцениватьВДеньОперации; 
	
	// такое бывает когда настройки не заданы и это нормальная ситуация (уточнил у бухгалтерии)
	// инвестдекларация не предполагает заключение сделок РЕПО и из учет не описан ни в правилах СЧА, ни в учетной политике для ЕПС
	Если ПериодичностьПереоценки = Неопределено Тогда 
		Возврат Ложь;
	КонецЕсли;
	
	Переоценивать = Ложь;
	Если ПериодичностьПереоценки = Перечисления.ПериодичностьПереоценкиАктивов.Ежедневно Тогда
		Переоценивать = Истина;
		Если НЕ ПереоцениватьВНерабочиеДни И НЕ РабочийДень И НЕ ПериодичностиДаты.ПериодичностьМесяц Тогда // последний день месяца - отчетная дата, палюбому
			Переоценивать = Ложь;
		КонецЕсли;
	ИначеЕсли БухгалтерскийУчетЕПС.ПроверкаНеобходимостиПереоценки(ПериодичностьПереоценки, Дата, КалендарьДляСчетаДУ) Тогда 
		Переоценивать = Истина;
	КонецЕсли;
	
	Если НЕ Переоценивать И ПереоцениватьВДеньОперации Тогда
		Переоценивать = Документы.ПереоценкаЗадолженностиПоДенежнымСредствам.ЕстьСделкиРЕПО(Дата, Организация, СчетДоверительногоУправления);
	КонецЕсли;
	
	Возврат Переоценивать;

КонецФункции

Функция Нужно_ЕПС_ПереоценитьКомиссиюПоРЕПО(Дата, Организация, СчетДоверительногоУправления) Экспорт
	
	Отказ = Ложь;
	
	НастройкиПоВидуУчета = БухгалтерскийУчет.ОпределитьНастройкиПоВидуУчета(
		Дата,
		Организация,
		СчетДоверительногоУправления,
		Перечисления.ВидыУчета.ЕдиныйБухгалтерскийУчет,
		Отказ);	
		
	Если НастройкиПоВидуУчета.МетодПризнанияРасходовПоСделкамРЕПО = Перечисления.МетодыПризнанияРасходовПоСделкам.ПриОплате
		ИЛИ НастройкиПоВидуУчета.МетодПризнанияРасходовПоСделкамРЕПО = Перечисления.МетодыПризнанияРасходовПоСделкам.ПриОткрытииРЕПО Тогда
		
		Возврат Ложь;
		
	КонецЕсли;
	
	КалендарьДляСчетаДУ = РаботаСПереоценкой.ПолучитьКалендарьДляСчетаДУ(Организация, СчетДоверительногоУправления, Дата);
	// воткнул т.к. задача ставилась НЕПРАВИЛЬНО и теперь затыкаю дыру
	РабочийДень = Справочники.Календари.ЭтоРабочийДень(КалендарьДляСчетаДУ, Дата);
	
	ПериодичностиДаты = БухгалтерскийУчетЕПС.ПолучитьПериодичностиДаты(Дата);
														
	НастройкиКомиссияПоРЕПО = БухгалтерскийУчет.ОпределитьНастройкиУчетаАктива(
									Дата,
									Организация,
									СчетДоверительногоУправления,
									Справочники.УчетныеАктивыЕПС.КомиссияПоРЕПО,
									Перечисления.ВидыУчета.ЕдиныйБухгалтерскийУчет);
														
	ПериодичностьПереоценки = 		НастройкиКомиссияПоРЕПО.ПериодичностьПереоценки;
	ПереоцениватьВНерабочиеДни = 	НастройкиКомиссияПоРЕПО.ПереоцениватьВНерабочиеДни;
	ПереоцениватьВДеньОперации = 	НастройкиКомиссияПоРЕПО.ПереоцениватьВДеньОперации;
	
	// такое бывает когда настройки не заданы и это нормальная ситуация (уточнил у бухгалтерии)
	// инвестдекларация не предполагает заключение сделок РЕПО и из учет не описан ни в правилах СЧА, ни в учетной политике для ЕПС
	Если ПериодичностьПереоценки = Неопределено Тогда 
		Возврат Ложь;
	КонецЕсли;
	
	Переоценивать = Ложь;
	Если ПериодичностьПереоценки = Перечисления.ПериодичностьПереоценкиАктивов.Ежедневно Тогда
		Переоценивать = Истина;
		Если НЕ ПереоцениватьВНерабочиеДни И НЕ РабочийДень И НЕ ПериодичностиДаты.ПериодичностьМесяц Тогда // последний день месяца - отчетная дата, палюбому
			Переоценивать = Ложь;
		КонецЕсли;
	ИначеЕсли БухгалтерскийУчетЕПС.ПроверкаНеобходимостиПереоценки(ПериодичностьПереоценки, Дата, КалендарьДляСчетаДУ) Тогда 	
		Переоценивать = Истина;
	КонецЕсли;
	
	Если НЕ Переоценивать И ПереоцениватьВДеньОперации Тогда
		Переоценивать = Документы.ПереоценкаЗадолженностиПоДенежнымСредствам.ЕстьСделкиРЕПО(Дата, Организация, СчетДоверительногоУправления);
	КонецЕсли;
	
	Возврат Переоценивать;
	
КонецФункции

Функция Нужно_ЕПС_ПризнатьРасходыПоБиржевымДепозитам(Дата, Организация, СчетДоверительногоУправления) Экспорт
	
	МетодПризнанияРасходовПоБиржевымДепозитам = БухгалтерскийУчет.ОпределитьНастройкуДляВидаУчета(
		Дата,
		Организация,
		СчетДоверительногоУправления,
		Перечисления.ВидыУчета.ЕдиныйБухгалтерскийУчет,
		"МетодПризнанияРасходовПоБиржевымДепозитам");	
		
		Возврат МетодПризнанияРасходовПоБиржевымДепозитам = Перечисления.МетодыПризнанияРасходовПоСделкам.ВЗависимостиОтПериодичности
		ИЛИ МетодПризнанияРасходовПоБиржевымДепозитам = Перечисления.МетодыПризнанияРасходовПоСделкам.ПриНачислении
		
КонецФункции
